Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a rectangular opening on a wall.
wall:  Host element of the opening.
pntStart: One corner of the rectangle.
pntEnd: The opposite corner of the rectangle.
Returns:  If successful, an Opening object is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the wall
does not exist in the given document, or if the wall doesn't support
rectangular openings.
Remarks: Slanted stacked walls do not support rectangular openings.